# Quick Overview of pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ["Samrachana","Sanskriti","Aditi","Princy"],
    "age" : [19,9,3,15],
    "city" : ["Kushma","Baglung","Pokhara","kathmandu"]
    }

In [3]:
# Dataframe is like excel sheet or a tabular form having rows and columns
# IT IS USED FOR ANALYZING BIG DATA EASILY
df=pd.DataFrame(dict1) # This fucntion converts the data into excel sheet format for easier indexing
print(df) # 0 1 2 3 are the index
df

         name  age       city
0  Samrachana   19     Kushma
1   Sanskriti    9    Baglung
2       Aditi    3    Pokhara
3      Princy   15  kathmandu

         name  age       city
0  Samrachana   19     Kushma
1   Sanskriti    9    Baglung
2       Aditi    3    Pokhara
3      Princy   15  kathmandu

### Exproting this DataFrame into excelsheet or csv format(comma seperated value)

In [4]:
df.to_csv("Myinfo.csv") 
# this csv file/ excel sheet is created in the same folder, if not present
# 0 1 2 3 index are also present
# df.to_csv() function is used when we need to keep that data in excel sheet after analyzing

In [5]:
# if we don't want the index 0 1 2 3 to appear in excel sheet:
df.to_csv("myinfo.csv", index=False) # overwrites the old file with new data

In [6]:
df.to_csv("myinfo_no_index.csv", index=False) # creates a new file with index = False

In [7]:
# for millions of data, we can choose if we want to see the first 3 data:
df.head(3)

         name  age     city
0  Samrachana   19   Kushma
1   Sanskriti    9  Baglung
2       Aditi    3  Pokhara

In [8]:
# If we want to see last 3/n data:
df.tail(3)

        name  age       city
1  Sanskriti    9    Baglung
2      Aditi    3    Pokhara
3     Princy   15  kathmandu

In [9]:
df.describe() # analyzes numerical columns, here in our case of dict1 numerical column is age.
# so it shows count mean std min quartiles of age column

        age
count   4.0
mean   11.5
std     7.0
min     3.0
25%     7.5
50%    12.0
75%    16.0
max    19.0

In [10]:
# lets create a csv file in excel and read it here:
train = pd.read_csv("train.csv") # here this train is dataframe

In [11]:
train # dataframe

   Unnamed: 0  Train No.  Speed       City
0           0      12322     34    newyork
1           1      12534    123     dallas
2           2     125654     50   colorado
3           3     564523     87  antratica

In [12]:
# Accessing a column:
print(train['Speed'])
print(train['City'])

0     34
1    123
2     50
3     87
Name: Speed, dtype: int64
0      newyork
1       dallas
2     colorado
3    antratica
Name: City, dtype: object

In [13]:
# Accessing a element:
print(train['City'][0])
print(train['Speed'][2])

newyork
50

In [14]:
# changing value:
train['City'][1]="dallas" # it is changed only here not in csv file
train['Speed'][2]=50
train

C:\Users\hp\AppData\Local\Temp\ipykernel_14780\1463476991.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['City'][1]="dallas" # it is changed only here not in csv file
C:\Users\hp\AppData\Local\Temp\ipykernel_14780\1463476991.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][2]=50

   Unnamed: 0  Train No.  Speed       City
0           0      12322     34    newyork
1           1      12534    123     dallas
2           2     125654     50   colorado
3           3     564523     87  antratica

In [15]:
# Updating the changed train in csv:
train.to_csv("train.csv")

In [16]:
# CHANGING INDEX:
train.index = ['first', 'second', 'third', 'fourth']
train

        Unnamed: 0  Train No.  Speed       City
first            0      12322     34    newyork
second           1      12534    123     dallas
third            2     125654     50   colorado
fourth           3     564523     87  antratica

In [17]:
train.index = [1,2,3,4]
train

   Unnamed: 0  Train No.  Speed       City
1           0      12322     34    newyork
2           1      12534    123     dallas
3           2     125654     50   colorado
4           3     564523     87  antratica

In [18]:
train.index = [2,4,8,7]
train

   Unnamed: 0  Train No.  Speed       City
2           0      12322     34    newyork
4           1      12534    123     dallas
8           2     125654     50   colorado
7           3     564523     87  antratica

## Let's go into a little depth

In [36]:
# pandas has two data structures: SERIES AND DATAFRAME
# series is Basically n by 1 data structure and data frame is row by column
ser = pd.Series(np.random.rand(10))
ser

0    0.812411
1    0.926887
2    0.519901
3    0.581540
4    0.963062
5    0.621446
6    0.848981
7    0.566831
8    0.741088
9    0.142525
dtype: float64

In [35]:
type(ser) # the type of ser is series

pandas.core.series.Series